Repository: Kardix/CurrentlyListening
Catalog: CurrentlyListening/Resources/Translations.*.resx
Languages: cs, de, es, fr, pl, pt, uk

# LOGIN_FAILED
source: Something went wrong with login data, please re-authorize
cs: Došlo k chybě s přihlašovacími údaji, prosím znovu autorizujte
de: Bei den Anmeldedaten ist ein Fehler aufgetreten, bitte erneut autorisieren
es: Algo salió mal con los datos de inicio de sesión, por favor vuelve a autorizar
fr: Une erreur s'est produite avec les données de connexion, veuillez réautoriser
pl: Wystąpił błąd danych logowania, proszę autoryzować ponownie
pt: Algo deu errado com os dados de login, por favor reautorize
uk: Сталася помилка, будь ласка, авторизуйтесь знову

# SELECT_OUTPUT
source: Select Output File Location
cs: Vyberte umístění výstupního souboru
de: Ausgabe-Dateispeicherort auswählen
es: Seleccionar ubicación del archivo de salida
fr: Sélectionner l'emplacement du fichier de sortie
pl: Wybierz lokalizację pliku wyjściowego
pt: Selecionar local do arquivo de saída
uk: Виберіть місце збереження файлу

# NOTHING_PLAYING
source: Nothing is currently playing.
cs: Momentálně nic nehraje.
de: Es wird derzeit nichts abgespielt.
es: Actualmente no se está reproduciendo nada.
fr: Rien n'est en cours de lecture.
pl: Nic nie jest aktualnie odtwarzane.
pt: Nada está tocando no momento.
uk: Зараз нічого не відтворюється.

source: Unknown Artist
cs: Neznámý interpret
de: Unbekannter Künstler
es: Artista desconocido
fr: Artiste inconnu
pl: Nieznany artysta
pt: Artista desconhecido
uk: Невідомий виконавець

source: Unknown Title
cs: Neznámý název
de: Unbekannter Titel
es: Título desconocido
fr: Titre inconnu
pl: Nieznany tytuł
pt: Título desconhecido
uk: Невідома назва

# FILE_SAVED
source: File path saved:\n{dialog.FileName}
cs: Cesta k souboru byla uložena:\n{dialog.FileName}
de: Dateipfad gespeichert:\n{dialog.FileName}
es: Ruta del archivo guardada:\n{dialog.FileName}
fr: Chemin du fichier enregistré:\n{dialog.FileName}
pl: Zapisano ścieżkę do pliku:\n{dialog.FileName}
pt: Caminho do arquivo salvo:\n{dialog.FileName}
uk: Шлях до файлу збережено:

# FILE_SAVED_CAPTION
source: Saved
cs: Uloženo
de: Gespeichert
es: Guardado
fr: Enregistré
pl: Zapisano
pt: Salvo
uk: Збережено

# AUTH_SUCCESS
source: Authorization successful. You can close this window.
cs: Autorizace byla úspěšná. Můžete zavřít toto okno.
de: Autorisierung erfolgreich. Sie können dieses Fenster schließen.
es: Autorización exitosa. Puedes cerrar esta ventana.
fr: Autorisation réussie. Vous pouvez fermer cette fenêtre.
pl: Autoryzacja zakończona sukcesem. Możesz zamknąć to okno.
pt: Autorização bem-sucedida. Você pode fechar esta janela.
uk: Авторизація успішна. Ви можете закрити це вікно.

# LOGIN_SUCCESS
source: Logged in successfully.
cs: Přihlášení bylo úspěšné.
de: Erfolgreich eingeloggt.
es: Inicio de sesión exitoso.
fr: Connexion réussie.
pl: Logowanie zakończone sukcesem.
pt: Login realizado com sucesso.
uk: Вхід виконано успішно.

# HELP_1_0
source: Optionally, before starting, register your own app at
cs: Volitelně si před začátkem zaregistrujte vlastní aplikaci na
de: Optional: Registrieren Sie vor dem Starten Ihre eigene App unter
es: Opcionalmente, antes de comenzar, registre su propia aplicación en
fr: Facultativement, avant de commencer, enregistrez votre propre application sur
pl: Opcjonalnie, przed rozpoczęciem, zarejestruj swoją aplikację na
pt: Opcionalmente, antes de começar, registre seu próprio aplicativo em
uk: За бажанням, перед початком зареєструйте свій додаток на

# HELP_1_1
source: Select the "Web API" as the platform, and set the callback URL to: http://127.0.0.1:5000/callback. Once created, you’ll find the Client ID and Client Secret in the app’s dashboard—these are needed for login.
cs: Jako platformu zvolte "Web API" a nastavte návratovou URL na: http://127.0.0.1:5000/callback. Po vytvoření najdete Client ID a Client Secret v dashboardu aplikace — ty jsou potřeba k přihlášení.
de: Wähle "Web API" als Plattform und setze die Callback-URL auf: http://127.0.0.1:5000/callback. Nach der Erstellung findest du die Client-ID und das Client-Secret im Dashboard der App — diese werden für die Anmeldung benötigt.
es: Selecciona "Web API" como plataforma y establece la URL de redirección en: http://127.0.0.1:5000/callback. Una vez creada, encontrarás el ID de cliente y el secreto de cliente en el panel de tu aplicación — necesarios para iniciar sesión..
fr: Sélectionnez "Web API" comme plateforme, puis définissez l’URL de redirection sur : http://127.0.0.1:5000/callback. Une fois l’application créée, vous trouverez l’ID client et le secret client dans le tableau de bord de l’application — nécessaires pour se connecter.
pl: Wybierz "Web API" jako platformę i ustaw URL zwrotny na: http://127.0.0.1:5000/callback. Po utworzeniu znajdziesz Client ID i Client Secret w panelu aplikacji — są one wymagane do logowania.
pt: Selecione "Web API" como plataforma e defina a URL de retorno para: http://127.0.0.1:5000/callback. Uma vez criado, você encontrará o Client ID e o Client Secret no painel da aplicação — necessários para o login.
uk: Виберіть "Web API" як платформу і встановіть callback-URL на: http://127.0.0.1:5000/callback. Після створення ви знайдете Client ID та Client Secret на панелі застосунку — вони потрібні для входу.

# HELP_2
source: 1. Click "Login to Spotify" to authenticate your account.
cs: 1. Klikněte na "Přihlásit se ke Spotify" pro ověření svého účtu.
de: 1. Klicken Sie auf "Bei Spotify anmelden", um Ihr Konto zu authentifizieren.
es: 1. Haga clic en "Iniciar sesión en Spotify" para autenticar su cuenta.
fr: 1. Cliquez sur "Se connecter à Spotify" pour authentifier votre compte.
pl: 1. Kliknij "Zaloguj się do Spotify", aby uwierzytelnić swoje konto.
pt: 1. Clique em "Entrar no Spotify" para autenticar sua conta.
uk: 1. Натисніть "Увійти в Spotify", щоб підтвердити свою обліковку.

# HELP_3
source: 2. Choose which track details to show: Artist, Song Title and/or Time.
cs: 2. Vyberte, které informace o skladbě se mají zobrazit: Umělec, Název skladby a/nebo Čas.
de: 2. Wählen Sie aus, welche Titeldetails angezeigt werden sollen: Künstler, Songtitel und/oder Zeit.
es: 2. Elija qué detalles de la pista mostrar: Artista, Título de la canción y/o Tiempo.
fr: 2. Choisissez les détails de piste à afficher : Artiste, Titre et/ou Temps.
pl: 2. Wybierz, które informacje o utworze wyświetlić: Artysta, Tytuł i/lub Czas.
pt: 2. Escolha quais detalhes da faixa mostrar: Artista, Título da música e/ou Tempo.
uk: 2. Оберіть, які дані треку показувати: Виконавець, Назва пісні та/або Час.

# HELP_4
source: 3. Use "Set Output File Location" to choose where track info will be written.
cs: 3. Použijte "Nastavit umístění výstupního souboru" pro výběr místa uložení informací o skladbě.
de: 3. Verwenden Sie "Ausgabe-Dateipfad festlegen", um festzulegen, wohin die Titeldaten geschrieben werden sollen.
es: 3. Use "Establecer ubicación del archivo de salida" para elegir dónde se escribirá la información de la pista.
fr: 3. Utilisez "Définir l'emplacement du fichier de sortie" pour choisir où les informations de piste seront écrites.
pl: 3. Użyj "Ustaw lokalizację pliku wyjściowego", aby wybrać miejsce zapisu informacji o utworze.
pt: 3. Use "Definir local do arquivo de saída" para escolher onde as informações da faixa serão gravadas.
uk: 3. Використовуйте "Вказати шлях до вихідного файлу", щоб вибрати, куди записуватиметься інформація.

# HELP_5
source: 4. Click "Update Display" to apply changes. The file updates automatically while the app is running.
cs: 4. Klikněte na "Aktualizovat zobrazení" pro použití změn. Soubor se automaticky aktualizuje během běhu aplikace.
de: 4. Klicken Sie auf "Anzeige aktualisieren", um Änderungen zu übernehmen. Die Datei wird automatisch während der Laufzeit der App aktualisiert.
es: 4. Haga clic en "Actualizar visualización" para aplicar los cambios. El archivo se actualiza automáticamente mientras la aplicación se está ejecutando.
fr: 4. Cliquez sur "Mettre à jour l'affichage" pour appliquer les modifications. Le fichier se met à jour automatiquement pendant que l'application est en cours d'exécution.
pl: 4. Kliknij "Aktualizuj wyświetlanie", aby zastosować zmiany. Plik jest aktualizowany automatycznie podczas działania aplikacji.
pt: 4. Clique em "Atualizar exibição" para aplicar as alterações. O arquivo é atualizado automaticamente enquanto o aplicativo está em execução.
uk: 4. Натисніть "Оновити відображення" для застосування змін. Файл оновлюється автоматично під час роботи додатку.

# HELP_TIP
source: Tip: You can use the output file in OBS overlays or stream widgets.
cs: Tip: Výstupní soubor můžete použít v OBS překryvech nebo streamovacích widgetech.
de: Tipp: Sie können die Ausgabedatei in OBS-Overlays oder Stream-Widgets verwenden.
es: Consejo: puede usar el archivo de salida en superposiciones OBS o widgets de transmisión.
fr: Astuce : vous pouvez utiliser le fichier de sortie dans les superpositions OBS ou les widgets de stream.
pl: Porada: możesz używać pliku wyjściowego w nakładkach OBS lub widgetach do streamowania.
pt: Dica: Você pode usar o arquivo de saída em sobreposições OBS ou widgets de stream.
uk: Порада: ви можете використовувати вихідний файл в OBS.
